{
    "leofromvermont": {
        "id": "leofromvermont",
        "name": "Leo From Vermont",
        "description": "When Leo was a boy one of the few VHS movies in his folks humble collection was a copy of mean streets. That along with Swiss Family Robinson, SNL, and your garden variety dreck. Has anyone ever actually watched the longest day? Seriously. I ask you. But anyway, things happen to a boy exposed that much Harvey Keitel that early in life. No amount of wizard of oz can bring you back, not even if you are a dandelion.\n\nMusic came next, and soon the spikor and snake eyes were replaced by some combination of Thriller, Oliver and company, and we’re not gonna take it. It was records of course but only because they were way cheaper than tapes or cd’s. It was the 80’s after all, you could still get Nike’s out of a random bin on the floor of Gaines.\n\nOne day a kid named Jeff played Leo a dubbed copy of the blueprint three seats up from the back of the bus, and that bullshit was OVER. Never was he able to walk by a grounded bottle of Snapple the same way again. I still miss Scott LaRock. Then DMC. Then PRT. They were native till the end now-a-days they don’t even speak. Prince Paul. Kool Keith. Company flow ruined everything. But they also saved everything. Build and destroy. Then radio. Then video. One night in a basement with John Demus and a bottle of E&J changed everything. But I digress...\n\nThere are few sadder scenes than a 20 something fat kid in a Fila jump suit and John Wallace Kani kicks with one leg pulled up at a weekly hip hop night at shithole called the bottle neck. But that kid was living the dream. And NO I don’t have ‘the gambler’ how long have you been here? Have you heard anything that sounds even remotely like that song? Fuck.\n\nFast forward to today and all he wants to do is have a little fun before he died. That and a little Boko-Maru.\n\nTruth be told, in the end he turned out to be a fuckin’ mook after all.",
        "image": "https://nighterrands.s3.amazonaws.com/images/artists/leofromvermont.jpg",
        "featured_releases": [
            "NE01",
            "NE04",
            "NE10"
        ]
    },
    "siamese": {
        "id": "siamese",
        "name": "Siamese Faith Healers Network",
        "description": "The Siamese faith healers network started as a privately unprofitable organization on the mean streets of Manchester. Slowly toiling in obscurity, making records nobody listened to and even fewer heard, they persevered.  The crew would hit the international and exotica bin of the local record and/or junk store while other kids their age were out smoking cigarettes and playing portishead cassettes.\n\nHalcyon days of wasted youth full of coal miners lung, vegan rice dishes flavored with aminos, and the island of forgotten toys that was their record totes. But from the ashes the network continued to rise.  Many records later they were rescued from their communal ergonomic dog bed by the crew at night errands. They played us their old shit from a broken iPod on some shitty gateway computer speakers and we were hooked. Welcome to the monkey house, come on in, the water is fine.\n\nTheir sound is equal parts Les Baxter, hung over Double Dee and Steinksi, the Bermuda Strollers, Prince Paul on qualudes, ehh, and, well, MORE Baxter I guess. These fools play black moth super rainbow at dinner parties and weep softly when they hear ‘sleep walk’ by Santo & Johnny. I’m sorry Mrs Yancey, your boy deserves better.\n\nPour yourself a tall warm glass of coconut rum and feel the humidity. No shoes, no shirt, no idea how we got to this bar on a Wednesday with equal parts bad intentions and misguided faith in humanity.  But I’ll have another, sure, what the hell. ",
        "image": "https://nighterrands.s3.amazonaws.com/images/artists/siamese.jpg",
        "featured_releases": [
            
        ]
    }
}